tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hmanager.c
/******************************************************************************
 Function Name   : usb_hstd_mgr_chgdevst_cb
 Description     : Call the callback function specified by the argument given to
 : the API usb_hstd_change_device_state.
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     rootport    : Root port number
 Return          : none
 ******************************************************************************/
static void usb_hstd_mgr_chgdevst_cb (usb_utr_t *ptr, uint16_t rootport)
{
    if (0 != usb_shstd_mgr_msginfo[ptr->ip])
    {
        if (USB_NULL == usb_shstd_mgr_callback[ptr->ip])   /* Chack Callback function */
        {
            while(1)
            {
                /* Error Stop */
            }
        }
        (*usb_shstd_mgr_callback[ptr->ip])(ptr, rootport, usb_shstd_mgr_msginfo[ptr->ip]);
        usb_shstd_mgr_msginfo[ptr->ip] = 0;
    }
}

/******************************************************************************
 End of function usb_hstd_mgr_chgdevst_cb
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_enumeration
 Description     : Execute enumeration on the connected USB device.
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
 Return          : uint16_t                 : Enumeration status.
 ******************************************************************************/
static uint16_t usb_hstd_enumeration (usb_utr_t *ptr)
{
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
    uint16_t vendor_id;
    uint16_t product_id;
#endif  /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */

    uint16_t md, flg;
    usb_hcdreg_t *driver;
    uint16_t enume_mode; /* Enumeration mode (device state) */
    uint8_t *descriptor_table;
    uint16_t rootport, pipenum, devsel;
    usb_ctrl_t ctrl;

    /* Attach Detect Mode */
    enume_mode = USB_NONDEVICE;

    pipenum = p_usb_shstd_mgr_msg[ptr->ip]->keyword;

    /* Agreement device address */
    devsel = usb_hstd_get_devsel(ptr, pipenum);

    /* Get root port number from device addr */
    rootport = usb_hstd_get_rootport(ptr, devsel);

    /* Manager Mode Change */
    switch (p_usb_shstd_mgr_msg[ptr->ip]->result)
    {
        case USB_CTRL_END :
            enume_mode = USB_DEVICEENUMERATION;
            switch (g_usb_hstd_enum_seq[ptr->ip])
            {
                /* Receive Device Descriptor */
                case 0 :
                break;

                    /* Set Address */
                case 1 :
                    descriptor_table = (uint8_t*) g_usb_hstd_device_descriptor[ptr->ip];
                    devsel = (uint16_t) (g_usb_hstd_device_addr[ptr->ip] << USB_DEVADDRBIT);

                    /* Set device speed */
                    usb_hstd_set_dev_addr(ptr, devsel, g_usb_hstd_device_speed[ptr->ip], rootport);
                    g_usb_hstd_dcp_register[ptr->ip][g_usb_hstd_device_addr[ptr->ip]] =
                            (uint16_t) ((uint16_t) (descriptor_table[7] & USB_MAXPFIELD) | devsel);
                break;

                    /* Receive Device Descriptor(18) */
                case 2 :
                break;

                    /* Receive Configuration Descriptor(9) */
                case 3 :
                break;

                    /* Receive Configuration Descriptor(xx) */
                case 4 :
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
                    descriptor_table = (uint8_t*)g_usb_hstd_device_descriptor[ptr->ip];

                    /* If 'vendor_id' and 'product_id' value is defined by PET, */
                    /*    system works for compliance test mode. */
                    /* Values ??defined by PET is the following. */
                    /* vendor_id : 0x1A0A  */
                    /* product_id : 0x0101 - 0x0108 , 0x0200 */

                    vendor_id = (uint16_t)(descriptor_table[USB_DEV_ID_VENDOR_L]
                            + ((uint16_t)descriptor_table[USB_DEV_ID_VENDOR_H] << 8));

                    if (0x1A0A == vendor_id)
                    {
                        product_id = (uint16_t)(descriptor_table[USB_DEV_ID_PRODUCT_L]
                                + ((uint16_t)descriptor_table[USB_DEV_ID_PRODUCT_H] << 8));

                        descriptor_table = (uint8_t*)g_usb_hstd_config_descriptor[ptr->ip];
#if USB_CFG_ELECTRICAL == USB_CFG_ENABLE

                        if ((0x0100 < product_id) && (product_id < 0x0109))
                        {
                            usb_hstd_electrical_test_mode(ptr, product_id, rootport);
                            enume_mode = USB_NOTTPL;
                            break;
                        }

#endif  /* USB_CFG_ELECTRICAL == USB_CFG_ENABLE */

                        if (0x0200 == product_id)
                        {
                            g_usb_hstd_enum_seq[ptr->ip]++;
                            break;
                        }
                    }

#endif  /* USB_CFG_ELECTRICAL == USB_CFG_ENABLE */

                    /* Device enumeration function */
                    switch (usb_hstd_enum_function1())
                    {
                        /* Driver open */
                        case USB_OK :
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
                            g_usb_disp_param_set    = USB_OFF;
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */

                            for (flg = 0u, md = 0; (md < g_usb_hstd_device_num[ptr->ip]) && (0u == flg); md++)
                            {
                                driver = &g_usb_hstd_device_drv[ptr->ip][md];
                                if (USB_DETACHED == driver->devstate)
                                {
                                    uint16_t retval;
                                    retval = usb_hstd_chk_device_class(ptr, driver, rootport);
                                    g_usb_hstd_check_enu_result[ptr->ip] = USB_OK;

                                    /* In this function, check device class of       */
                                    /*              enumeration flow move to class   */
                                    /* "usb_hstd_return_enu_mgr()" is used to return */
                                    if (USB_OK == retval)
                                    {
                                        usb_shstd_reg_pointer[ptr->ip] = md;
                                        flg = 1; /* break; */
                                    }
                                }
                            }

#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
                            if (USB_ON == g_usb_disp_param_set)
                            {
                                usb_compliance_disp ((void *)&g_usb_disp_param);
                            }
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */

