tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hmanager.c
                            if (1 != flg)
                            {

                                ctrl.address = g_usb_hstd_device_addr[ptr->ip];     /* USB Device address */
                                ctrl.module = ptr->ip;                              /* Module number setting */
                                usb_set_event(USB_STS_NOT_SUPPORT, &ctrl);          /* Set Event()  */

#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
                                g_usb_hstd_enum_seq[ptr->ip] = g_usb_hstd_enum_seq[ptr->ip] + 2;

#else /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */
                                g_usb_hstd_enum_seq[ptr->ip]++;

#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */
                            }
                        break;

                            /* Descriptor error */
                        case USB_ERROR :
                            USB_PRINTF0("### Enumeration is stoped(ClassCode-ERROR)\n");
                            enume_mode = USB_NOTTPL; /* Attach Detect Mode */
                        break;
                        default :
                            enume_mode = USB_NONDEVICE; /* Attach Detect Mode */
                        break;
                    }
                break;

                    /* Class Check Result */
                case 5 :
                    switch (g_usb_hstd_check_enu_result[ptr->ip])
                    {
                        case USB_OK :
                            driver = &g_usb_hstd_device_drv[ptr->ip][usb_shstd_reg_pointer[ptr->ip]];
                            /* Root port */
                            g_usb_hstd_device_info[ptr->ip][g_usb_hstd_device_addr[ptr->ip]][0] = rootport;
                            driver->rootport = rootport;
                            driver->devaddr = g_usb_hstd_device_addr[ptr->ip];
                        break;
                        case USB_ERROR :
                            enume_mode = USB_NOTTPL;
                        break;
                        default :
                            enume_mode = USB_NONDEVICE;
                        break;
                    }
                break;

                    /* Set Configuration */
                case 6 :

                    /* Device enumeration function */
                    if (usb_hstd_enum_function2(&enume_mode) == USB_TRUE)
                    {
                        USB_PRINTF0(" Configured Device\n");
                        for (md = 0; md < g_usb_hstd_device_num[ptr->ip]; md++)
                        {
                            driver = &g_usb_hstd_device_drv[ptr->ip][md];
                            if (g_usb_hstd_device_addr[ptr->ip] == driver->devaddr)
                            {
                                /* Device state */
                                g_usb_hstd_device_info[ptr->ip][g_usb_hstd_device_addr[ptr->ip]][1] = USB_CONFIGURED;

                                /* Device speed */
                                g_usb_hstd_device_info[ptr->ip][g_usb_hstd_device_addr[ptr->ip]][4] =
                                        g_usb_hstd_device_speed[ptr->ip];

                                /* Device state */
                                driver->devstate = USB_CONFIGURED;
                                if (USB_NULL == driver->devconfig)   /* Chack Callback function */
                                {
                                    while(1)
                                    {
                                        /* Error Stop */
                                    }
                                }
                                /* Call Back */
                                (*driver->devconfig)(ptr, g_usb_hstd_device_addr[ptr->ip], (uint16_t) USB_NO_ARG);
                                return (USB_COMPLETEPIPESET);
                            }
                        }
                        enume_mode = USB_COMPLETEPIPESET;
                    }
                break;

                default :
                break;
            }
            g_usb_hstd_enum_seq[ptr->ip]++;

            /* Device Enumeration */
            if (USB_DEVICEENUMERATION == enume_mode)
            {
                switch (g_usb_hstd_enum_seq[ptr->ip])
                {
                    case 1 :
                        if (USB_NULL == g_usb_hstd_enumaration_process[1])   /* Chack Callback function */
                        {
                            while(1)
                            {
                                /* Error Stop */
                            }
                        }
                        (*g_usb_hstd_enumaration_process[1])(ptr, (uint16_t) USB_DEVICE_0,
                                g_usb_hstd_device_addr[ptr->ip]);
                    break;
                    case 5 :
                    break;
                    case 6 :
                        descriptor_table = (uint8_t*) g_usb_hstd_config_descriptor[ptr->ip];

                        /* Device state */
                        g_usb_hstd_device_info[ptr->ip][g_usb_hstd_device_addr[ptr->ip]][2] = descriptor_table[5];
                        if (USB_NULL == g_usb_hstd_enumaration_process[6])   /* Chack Callback function */
                        {
                            while(1)
                            {
                                /* Error Stop */
                            }
                        }
                        (*g_usb_hstd_enumaration_process[6])(ptr, g_usb_hstd_device_addr[ptr->ip],
                                (uint16_t) (descriptor_table[5]));
                    break;
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
                        case 7:
                        enume_mode = USB_NOTTPL;
                        break;
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */
                    default :
                        /* Chack Callback function */
                        if (USB_NULL == g_usb_hstd_enumaration_process[g_usb_hstd_enum_seq[ptr->ip]])
                        {
                            while(1)
                            {
                                /* Error Stop */
                            }
                        }
                        (*g_usb_hstd_enumaration_process[g_usb_hstd_enum_seq[ptr->ip]])(ptr,
                                g_usb_hstd_device_addr[ptr->ip], g_usb_hstd_enum_seq[ptr->ip]);
                    break;
                }
            }
        break;
        case USB_DATA_ERR :
            USB_PRINTF0("### Enumeration is stoped(SETUP or DATA-ERROR)\n");
            usb_hstd_enumeration_err(g_usb_hstd_enum_seq[ptr->ip]);
        break;
        case USB_DATA_OVR :
            USB_PRINTF0("### Enumeration is stoped(receive data over)\n");
            usb_hstd_enumeration_err(g_usb_hstd_enum_seq[ptr->ip]);
        break;
        case USB_DATA_STALL :
            USB_PRINTF0("### Enumeration is stoped(SETUP or DATA-STALL)\n");
            usb_hstd_enumeration_err(g_usb_hstd_enum_seq[ptr->ip]);

            /* Device enumeration function */
            usb_hstd_enum_function4(&g_usb_hstd_enum_seq[ptr->ip], &enume_mode, g_usb_hstd_device_addr[ptr->ip]);
        break;
        default :
            USB_PRINTF0("### Enumeration is stoped(result error)\n");
            usb_hstd_enumeration_err(g_usb_hstd_enum_seq[ptr->ip]);
        break;
    }
    return (enume_mode);
}
/******************************************************************************
 End of function usb_hstd_enumeration
 ******************************************************************************/

