tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hmanager.c
/******************************************************************************
 Function Name   : usb_hstd_enum_set_address
 Description     : Send SetAddress to the connected USB device.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     addr    : Device Address.
                 : uint16_t     setaddr : New address.
 Return          : none
 ******************************************************************************/
void usb_hstd_enum_set_address (usb_utr_t *ptr, uint16_t addr, uint16_t setaddr)
{
    usb_shstd_std_request[ptr->ip][0] = USB_SET_ADDRESS | USB_HOST_TO_DEV | USB_STANDARD | USB_DEVICE;
    usb_shstd_std_request[ptr->ip][1] = setaddr;
    usb_shstd_std_request[ptr->ip][2] = (uint16_t) 0x0000;
    usb_shstd_std_request[ptr->ip][3] = (uint16_t) 0x0000;
    usb_shstd_std_request[ptr->ip][4] = addr;
    usb_shstd_std_req_msg[ptr->ip].keyword = (uint16_t) USB_PIPE0;
    usb_shstd_std_req_msg[ptr->ip].p_tranadr = (void *) &usb_shstd_dummy_data;
    usb_shstd_std_req_msg[ptr->ip].tranlen = (uint32_t) usb_shstd_std_request[ptr->ip][3];
    usb_shstd_std_req_msg[ptr->ip].p_setup = usb_shstd_std_request[ptr->ip];
    usb_shstd_std_req_msg[ptr->ip].status = USB_DATA_NONE;
    usb_shstd_std_req_msg[ptr->ip].complete = (usb_cb_t) &usb_hstd_submit_result;
    usb_shstd_std_req_msg[ptr->ip].segment = USB_TRAN_END;

    usb_shstd_std_req_msg[ptr->ip].ipp = ptr->ipp;
    usb_shstd_std_req_msg[ptr->ip].ip = ptr->ip;

    usb_hstd_transfer_start(&usb_shstd_std_req_msg[ptr->ip]);
}
/******************************************************************************
 End of function usb_hstd_enum_set_address
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_enum_set_configuration
 Description     : Send SetConfiguration to the connected USB device.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     addr    : Device Address.
                 : uint16_t     confnum : Configuration number.
 Return          : none
 ******************************************************************************/
void usb_hstd_enum_set_configuration (usb_utr_t *ptr, uint16_t addr, uint16_t confnum)
{
    usb_shstd_std_request[ptr->ip][0] = USB_SET_CONFIGURATION | USB_HOST_TO_DEV | USB_STANDARD | USB_DEVICE;
    usb_shstd_std_request[ptr->ip][1] = confnum;
    usb_shstd_std_request[ptr->ip][2] = (uint16_t) 0x0000;
    usb_shstd_std_request[ptr->ip][3] = (uint16_t) 0x0000;
    usb_shstd_std_request[ptr->ip][4] = addr;
    usb_shstd_std_req_msg[ptr->ip].keyword = (uint16_t) USB_PIPE0;
    usb_shstd_std_req_msg[ptr->ip].p_tranadr = (void *) &usb_shstd_dummy_data;
    usb_shstd_std_req_msg[ptr->ip].tranlen = (uint32_t) usb_shstd_std_request[ptr->ip][3];
    usb_shstd_std_req_msg[ptr->ip].p_setup = usb_shstd_std_request[ptr->ip];
    usb_shstd_std_req_msg[ptr->ip].status = USB_DATA_NONE;
    usb_shstd_std_req_msg[ptr->ip].complete = (usb_cb_t) &usb_hstd_submit_result;
    usb_shstd_std_req_msg[ptr->ip].segment = USB_TRAN_END;

    usb_shstd_std_req_msg[ptr->ip].ipp = ptr->ipp;
    usb_shstd_std_req_msg[ptr->ip].ip = ptr->ip;

    usb_hstd_transfer_start(&usb_shstd_std_req_msg[ptr->ip]);
}
/******************************************************************************
 End of function usb_hstd_enum_set_configuration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_enum_dummy_request
 Description     : Dummy function.
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     addr        : Device Address
                 : uint16_t     cnt_value   : Enumeration Sequence
 Return          : none
 ******************************************************************************/
void usb_hstd_enum_dummy_request (usb_utr_t *ptr, uint16_t addr, uint16_t cnt_value)
{
    /* Non */
}
/******************************************************************************
 End of function usb_hstd_enum_dummy_request
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_mgr_suspend
 Description     : Suspend request
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     info    : Info for release of memory block.
 Return          : none
 ******************************************************************************/
void usb_hstd_mgr_suspend (usb_utr_t *ptr, uint16_t info)
{
    uint16_t rootport, devaddr, devsel;
    uint16_t j;

    devaddr = p_usb_shstd_mgr_msg[ptr->ip]->keyword;
    devsel = (uint16_t) (devaddr << USB_DEVADDRBIT);

    /* Get root port number from device addr */
    rootport = usb_hstd_get_rootport(ptr, devsel);

    if (usb_hstd_chk_dev_addr(ptr, devsel, rootport) != USB_NOCONNECT)
    {
        /* PIPE suspend */
        for (j = USB_MIN_PIPE_NO; j <= USB_MAX_PIPE_NO; j++)
        {
            /* Agreement device address */
            if (usb_hstd_get_devsel(ptr, j) == devsel)
            {
                /* PID=BUF ? */
                if (usb_cstd_get_pid(ptr, j) == USB_PID_BUF)
                {
                    usb_cstd_set_nak(ptr, j);
                    g_usb_hstd_suspend_pipe[ptr->ip][j] = USB_SUSPENDED;
                }
            }
        }
        usb_shstd_suspend_seq[ptr->ip] = 0;
        usb_hstd_susp_cont(ptr, (uint16_t) devaddr, (uint16_t) rootport);
        g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_SUSPENDED_PROCESS;
    }
    usb_hstd_mgr_rel_mpl(ptr, info);
}
/******************************************************************************
 End of function usb_hstd_mgr_suspend
 ******************************************************************************/

