tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hmanager.c
/******************************************************************************
 Function Name   : usb_hstd_device_state_ctrl
 Description     : Setup a call to the function usb_hstd_change_device_state to re-
                 : quest the connected USB Device to change status.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     devaddr : Device address.
                 : uint16_t     msginfo : Request type.
 Return          : none
 ******************************************************************************/
void usb_hstd_device_state_ctrl (usb_utr_t *ptr, uint16_t devaddr, uint16_t msginfo)
{
    switch (devaddr)
    {
        case 0 :
            USB_PRINTF0("### usbd_message device address error\n");
        break;
        case USB_DEVICEADDR :
            usb_hstd_hcd_snd_mbx(ptr, msginfo, USB_PORT0, (uint16_t*) 0, &usb_hstd_status_result);
        break;
        default :
            if (USB_HUBDPADDR <= devaddr)
            {
                /* Non */
            }
        break;
    }
}
/******************************************************************************
 End of function usb_hstd_device_state_ctrl
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_device_state_ctrl2
 Description     : Setup a call to the function usb_hstd_change_device_state to re-
                 : quest the connected USB Device to change status.
 Arguments       : usb_utr_t    *ptr             : Pointer to usb_utr_t structure
                 : usb_cb_t     complete         : Callback function Pointer
                 : uint16_t     devaddr          : Device address
                 : uint16_t     msginfo          : Request type for HCD
                 : uint16_t     mgr_msginfo      : Request type for MGR
 Return          : none
 ******************************************************************************/
void usb_hstd_device_state_ctrl2 (usb_utr_t *ptr, usb_cb_t complete, uint16_t devaddr, uint16_t msginfo,
        uint16_t mgr_msginfo)
{
    usb_shstd_mgr_callback[ptr->ip] = complete;
    usb_shstd_mgr_msginfo[ptr->ip] = mgr_msginfo;
    usb_hstd_device_state_ctrl(ptr, devaddr, msginfo);
}
/******************************************************************************
 End of function usb_hstd_device_state_ctrl2
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_mgr_reset
 Description     : Request HCD (Host Control Driver) to do a USB bus reset.
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     devaddr : Device address.
 Return          : none
 ******************************************************************************/
void usb_hstd_mgr_reset (usb_utr_t *ptr, uint16_t addr)
{
    usb_hstd_device_state_ctrl(ptr, addr, (uint16_t) USB_MSG_HCD_USBRESET);
    if (USB_DEVICEADDR == addr)
    {
        g_usb_hstd_mgr_mode[ptr->ip][USB_PORT0] = USB_DEFAULT;
    }
    else
    {
        /* Non */
    }
}
/******************************************************************************
 End of function usb_hstd_mgr_reset
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_mgr_resume
 Description     : Request HCD (Host Control Device) to send RESUME signal.
 Arguments       : usb_utr_t    *ptr : Pointer to usb_utr_t structure
                 : uint16_t     info : Information.
 Return          : none
 ******************************************************************************/
void usb_hstd_mgr_resume (usb_utr_t *ptr, uint16_t info)
{
    uint16_t rootport, devaddr, devsel;

    devaddr = p_usb_shstd_mgr_msg[ptr->ip]->keyword;
    devsel = (uint16_t) (devaddr << USB_DEVADDRBIT);

    /* Get root port number from device addr */
    rootport = usb_hstd_get_rootport(ptr, devsel);
    if (usb_hstd_chk_dev_addr(ptr, devsel, rootport) != USB_NOCONNECT)
    {
        /* Device resume */
        usb_hstd_device_state_ctrl(ptr, devaddr, p_usb_shstd_mgr_msg[ptr->ip]->msginfo);
        g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_RESUME_PROCESS;
        usb_shstd_resume_seq[ptr->ip] = 0;
    }
    usb_hstd_mgr_rel_mpl(ptr, info);
}
/******************************************************************************
 End of function usb_hstd_mgr_resume
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_susp_cont
 Description     : Suspend the connected USB Device (Function for nonOS)
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     devaddr     : Device Address
                 : uint16_t     rootport    : Port number
 Return          : none
 ******************************************************************************/
static void usb_hstd_susp_cont (usb_utr_t *ptr, uint16_t devaddr, uint16_t rootport)
{
    uint16_t checkerr;

    checkerr = p_usb_shstd_mgr_msg[ptr->ip]->result;

    switch (usb_shstd_suspend_seq[ptr->ip])
    {
        case 0 :
            usb_hstd_get_config_desc(ptr, devaddr, (uint16_t) 0x09, (usb_cb_t) &usb_hstd_submit_result);
            usb_shstd_suspend_seq[ptr->ip]++;
        break;
        case 1 :
            if (usb_hstd_std_req_check(checkerr) == USB_OK)
            {
                if (usb_hstd_chk_remote(ptr) == USB_TRUE)
                {
                    usb_hstd_set_feature(ptr, devaddr, (uint16_t) 0xFF, (usb_cb_t) &usb_hstd_submit_result);
                    usb_shstd_suspend_seq[ptr->ip]++;
                }
                else
                {
                    USB_PRINTF0("### Remote wakeup disable\n");
                    usb_hstd_device_state_ctrl(ptr, devaddr, (uint16_t) USB_MSG_HCD_REMOTE);
                    g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_SUSPENDED;
                }
            }
        break;
        case 2 :
            if (usb_hstd_std_req_check(checkerr) == USB_OK)
            {
                usb_hstd_device_state_ctrl(ptr, devaddr, (uint16_t) USB_MSG_HCD_REMOTE);
                g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_SUSPENDED;
            }
        break;
        default :
        break;
    }
}
/******************************************************************************
 End of function usb_hstd_susp_cont
 ******************************************************************************/

