tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hmanager.c
    return usb_hstd_cmd_submit(ptr, complete);
}
/******************************************************************************
 End of function usb_hstd_set_feature
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_get_config_desc
 Description     : Set GetConfigurationDescriptor
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     addr        : device address
                 : uint16_t     length      : descriptor length
                 : usb_cb_t     complete    : callback function
 Return value    : uint16_t                 : error info
 ******************************************************************************/
uint16_t usb_hstd_get_config_desc (usb_utr_t *ptr, uint16_t addr, uint16_t length, usb_cb_t complete)
{
    uint16_t i;

    /* Get Configuration Descriptor */
    g_usb_hstd_class_request[ptr->ip][0] = USB_GET_DESCRIPTOR | USB_DEV_TO_HOST | USB_STANDARD | USB_DEVICE;
    g_usb_hstd_class_request[ptr->ip][1] = USB_CONF_DESCRIPTOR;
    g_usb_hstd_class_request[ptr->ip][2] = (uint16_t) 0x0000;
    g_usb_hstd_class_request[ptr->ip][3] = length;
    if (g_usb_hstd_class_request[ptr->ip][3] > CLSDATASIZE)
    {
        g_usb_hstd_class_request[ptr->ip][3] = (uint16_t) CLSDATASIZE;
        USB_PRINTF0("***WARNING Descriptor size over !\n");
    }
    g_usb_hstd_class_request[ptr->ip][4] = addr;

    for (i = 0; i < g_usb_hstd_class_request[ptr->ip][3]; i++)
    {
        g_usb_hstd_class_data[ptr->ip][i] = (uint8_t) 0xFF;
    }

    return usb_hstd_cmd_submit(ptr, complete);
}
/******************************************************************************
 End of function usb_hstd_get_config_desc
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_std_req_check
 Description     : Sample Standard Request Check
 Arguments       : uint16_t errcheck        : error
 Return value    : uint16_t                 : error info
 ******************************************************************************/
uint16_t usb_hstd_std_req_check (uint16_t errcheck)
{
    if (USB_DATA_TMO == errcheck)
    {
        USB_PRINTF0("*** Standard Request Timeout error !\n");
        return USB_ERROR;
    }
    else if (USB_DATA_STALL == errcheck)
    {
        USB_PRINTF0("*** Standard Request STALL !\n");
        return USB_ERROR;
    }
    else if (USB_CTRL_END != errcheck)
    {
        USB_PRINTF0("*** Standard Request error !\n");
        return USB_ERROR;
    }
    else
    {
        /* Non */
    }
    return USB_OK;
}
/******************************************************************************
 End of function usb_hstd_std_req_check
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_get_string_desc
 Description     : Set GetDescriptor
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     addr        : device address
                 : uint16_t     string      : descriptor index
                 : usb_cb_t     complete    : callback function
 Return value    : uint16_t                 : error info
 ******************************************************************************/
uint16_t usb_hstd_get_string_desc (usb_utr_t *ptr, uint16_t addr, uint16_t string, usb_cb_t complete)
{
    uint16_t i;

    if (0 == string)
    {
        g_usb_hstd_class_request[ptr->ip][2] = (uint16_t) 0x0000;
        g_usb_hstd_class_request[ptr->ip][3] = (uint16_t) 0x0004;
    }
    else
    {
        /* Set LanguageID */
        g_usb_hstd_class_request[ptr->ip][2] = (uint16_t) (g_usb_hstd_class_data[ptr->ip][2]);
        g_usb_hstd_class_request[ptr->ip][2] |= (uint16_t) ((uint16_t) (g_usb_hstd_class_data[ptr->ip][3]) << 8);
        g_usb_hstd_class_request[ptr->ip][3] = (uint16_t) CLSDATASIZE;
    }
    g_usb_hstd_class_request[ptr->ip][0] = USB_GET_DESCRIPTOR | USB_DEV_TO_HOST | USB_STANDARD | USB_DEVICE;
    g_usb_hstd_class_request[ptr->ip][1] = (uint16_t) (USB_STRING_DESCRIPTOR + string);
    g_usb_hstd_class_request[ptr->ip][4] = addr;

    for (i = 0; i < g_usb_hstd_class_request[ptr->ip][3]; i++)
    {
        g_usb_hstd_class_data[ptr->ip][i] = (uint8_t) 0xFF;
    }

    return usb_hstd_cmd_submit(ptr, complete);
}
/******************************************************************************
 End of function usb_hstd_get_string_desc
 ******************************************************************************/

#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
#if USB_CFG_ELECTRICAL == USB_CFG_ENABLE
/******************************************************************************
 Function Name   : usb_hstd_electrical_test_mode
 Description     : Host electrical test mode function
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     product_id  : Task Start Code
                 : uint16_t     port        : Port number
 Return          : none
 ******************************************************************************/
void usb_hstd_electrical_test_mode(usb_utr_t *ptr, uint16_t product_id, uint16_t port)
{
    uint16_t brdysts;

    switch(product_id)
    {
        case 0x0101: /* Test_SE0_NAK */
            usb_hstd_test_signal(ptr, port, 3);
            while (1)
            {
                /* This loops infinitely until it's reset. */
            }
        break;
        case 0x0102: /* Test_J */
            usb_hstd_test_signal(ptr, port, 1);
            while (1)
            {
                /* This loops infinitely until it's reset. */
            }
        break;
        case 0x0103: /* Test_K */
            usb_hstd_test_signal(ptr, port, 2);
            while (1)
            {
                /* This loops infinitely until it's reset. */
            }
            break;
        case 0x0104: /* Test_Packet */
            usb_hstd_test_signal(ptr, port, 4);
            while (1)
            {
                /* This loops infinitely until it's reset. */
            }
        break;
        case 0x0105: /* Reserved */
        break;
        case 0x0106: /* HS_HOST_PORT_SUSPEND_RESUME */
            usb_cpu_delay_xms(15000); /* wait 15sec */
            usb_hstd_test_suspend(ptr, port);
            usb_cpu_delay_xms(15000); /* wait 15sec */
            usb_hstd_test_resume(ptr, port);
        break;
        case 0x0107: /* SINGLE_STEP_GET_DEV_DESC */
            usb_cpu_delay_xms(15000); /* wait 15sec */
            hw_usb_hwrite_usbreq(ptr, (USB_GET_DESCRIPTOR | USB_DEV_TO_HOST | USB_STANDARD | USB_DEVICE));
            hw_usb_hset_usbval(ptr, USB_DEV_DESCRIPTOR);
            hw_usb_hset_usbleng(ptr, 0x0012);
            hw_usb_hset_sureq(ptr);
        break;
        case 0x0108: /* SINGLE_STEP_GET_DEV_DESC_DATA */
            hw_usb_hwrite_usbreq(ptr, (USB_GET_DESCRIPTOR | USB_DEV_TO_HOST | USB_STANDARD | USB_DEVICE));
            hw_usb_hset_usbval(ptr, USB_DEV_DESCRIPTOR);
            hw_usb_hset_usbindx(ptr, 0x0000);
            hw_usb_hset_usbleng(ptr, 0x0012);
            hw_usb_hset_sureq(ptr);
            usb_cpu_delay_xms(15000); /* wait 15sec */

            usb_cstd_set_nak(ptr, USB_PIPE0);
            hw_usb_write_dcpcfg(ptr, 0);

            hw_usb_hwrite_dcpctr( ptr,USB_SQSET);                      /* debug */
            usb_hstd_do_sqtgl(ptr, (uint16_t)USB_PIPE0, USB_SQMON);      /* debug */

            hw_usb_rmw_fifosel(ptr, USB_CUSE, (USB_RCNT|USB_PIPE0), (USB_RCNT|USB_ISEL|USB_CURPIPE));
            hw_usb_set_bclr(ptr, USB_CUSE);
            usb_cstd_set_buf(ptr,USB_PIPE0);
            do
            {
                brdysts = hw_usb_read_brdysts(ptr);
            }while (!(brdysts&USB_BRDY0));
            usb_cstd_set_nak(ptr, USB_PIPE0);
            hw_usb_set_sqclr(ptr, USB_PIPE0);
            hw_usb_set_bclr(ptr, USB_CUSE);
        break;
        default:
        break;
    }
}
/******************************************************************************
 End of function usb_hstd_electrical_test_mode
 ******************************************************************************/
#endif /* USB_CFG_ELECTRICAL == USB_CFG_ENABLE */
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */

