tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hmanager.c
/******************************************************************************
 Function Name   : usb_hstd_mgr_task
 Description     : The host manager (MGR) task.
 Argument        : usb_vp_int_t stacd          : Task Start Code
 Return          : none
 ******************************************************************************/
void usb_hstd_mgr_task (usb_vp_int_t stacd)
{
    usb_utr_t *mess, *ptr;
    usb_er_t err;
    usb_hcdreg_t *driver;
    usb_hcdinfo_t *hp;
    uint16_t rootport, devaddr, devsel, pipenum, msginfo;
    uint16_t md;
    uint16_t enume_mode; /* Enumeration mode (device state) */
    uint16_t connect_speed;
    usb_ctrl_t ctrl;
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
    usb_compliance_t disp_param;
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */

    /* Receive message */
    err = USB_TRCV_MSG(USB_MGR_MBX, (usb_msg_t** )&mess, (usb_tm_t )10000);
    if (USB_OK != err)
    {
        return;
    }
    else
    {
        p_usb_shstd_mgr_msg[mess->ip] = (usb_mgrinfo_t*) mess;
        rootport = p_usb_shstd_mgr_msg[mess->ip]->keyword;
        devaddr = p_usb_shstd_mgr_msg[mess->ip]->keyword;
        pipenum = p_usb_shstd_mgr_msg[mess->ip]->keyword;
        devsel = (uint16_t) (devaddr << USB_DEVADDRBIT);
        hp = (usb_hcdinfo_t*) mess;
        ptr = mess;

        /* Detach is all device */
        msginfo = p_usb_shstd_mgr_msg[ptr->ip]->msginfo;
        switch (p_usb_shstd_mgr_msg[ptr->ip]->msginfo)
        {
            /* USB-bus control (change device state) */
            case USB_MSG_MGR_STATUSRESULT :
                switch (g_usb_hstd_mgr_mode[ptr->ip][rootport])
                {
                    /* End of reset signal */
                    case USB_DEFAULT :
                        g_usb_hstd_device_speed[ptr->ip] = p_usb_shstd_mgr_msg[ptr->ip]->result;

                        /* Set device speed */
                        usb_hstd_set_dev_addr(ptr, (uint16_t) USB_DEVICE_0, g_usb_hstd_device_speed[ptr->ip], rootport);
                        g_usb_hstd_dcp_register[ptr->ip][0] = (uint16_t) (USB_DEFPACKET + USB_DEVICE_0);
                        g_usb_hstd_enum_seq[ptr->ip] = 0;
                        switch (g_usb_hstd_device_speed[ptr->ip])
                        {
                            case USB_HSCONNECT : /* Hi Speed Device Connect */
                                USB_PRINTF0(" Hi-Speed Device\n");
                                if (USB_NULL == g_usb_hstd_enumaration_process[0])   /* Chack Callback function */
                                {
                                    while(1)
                                    {
                                        /* Error Stop */
                                    }
                                }
                                (*g_usb_hstd_enumaration_process[0])(ptr, (uint16_t) USB_DEVICE_0, (uint16_t) 0);
                            break;
                            case USB_FSCONNECT : /* Full Speed Device Connect */
                                USB_PRINTF0(" Full-Speed Device\n");
                                if (USB_NULL == g_usb_hstd_enumaration_process[0])   /* Chack Callback function */
                                {
                                    while(1)
                                    {
                                        /* Error Stop */
                                    }
                                }
                                (*g_usb_hstd_enumaration_process[0])(ptr, (uint16_t) USB_DEVICE_0, (uint16_t) 0);
                            break;
                            case USB_LSCONNECT : /* Low Speed Device Connect */
                                USB_PRINTF0(" Low-Speed Device\n");
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX71M)
                                usb_hstd_ls_connect_function(ptr);
#else   /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX71M) */
                                g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_DETACHED;

                                ctrl.address = 0;                               /* USB Device address */
                                ctrl.module = ptr->ip;                          /* Module number setting */
                                usb_set_event(USB_STS_NOT_SUPPORT, &ctrl);      /* Set Event()  */

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX71M) */
                            break;
                            default :
                                USB_PRINTF0(" Device/Detached\n");
                                g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_DETACHED;
                            break;
                        }
                    break;

                        /* End of resume signal */
                    case USB_CONFIGURED :

                        /* This Resume Sorce is moved to usb_hResuCont() by nonOS */
                    break;

                        /* Start of suspended state */
                    case USB_SUSPENDED :
                        for (md = 0; md < g_usb_hstd_device_num[ptr->ip]; md++)
                        {
                            driver = &g_usb_hstd_device_drv[ptr->ip][md];
                            if ((rootport + USB_DEVICEADDR) == driver->devaddr)
                            {
                                if (USB_NULL == driver->devsuspend)   /* Chack Callback function */
                                {
                                    while(1)
                                    {
                                        /* Error Stop */
                                    }
                                }
                                (*driver->devsuspend)(ptr, driver->devaddr, (uint16_t) USB_NO_ARG);

                                if (USB_DO_GLOBAL_SUSPEND == usb_shstd_mgr_msginfo[ptr->ip])
                                {
                                    usb_hstd_mgr_chgdevst_cb(ptr, rootport);
                                }

