tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hmanager.c
                                /* Device state */
                                g_usb_hstd_device_info[ptr->ip][driver->devaddr][1] = USB_SUSPENDED;

                                /* Device state */
                                driver->devstate = USB_SUSPENDED;
                            }
                        }
                    break;

                        /* Continue of resume signal */
                    case USB_RESUME_PROCESS :

                        /* Resume Sequence Number is 0 */
                        usb_hstd_resu_cont(ptr, (uint16_t) (USB_DEVICEADDR + rootport), (uint16_t) rootport);
                    break;

                    case USB_DETACHED :
                        switch (usb_shstd_mgr_msginfo[ptr->ip])
                        {
                            case USB_PORT_DISABLE :
                                usb_hstd_mgr_chgdevst_cb(ptr, rootport);
                            break;
                            default :
                            break;
                        }
                    break;

                    default :
                    break;
                }
                usb_hstd_mgr_rel_mpl(ptr, msginfo);
            break;

            case USB_MSG_MGR_SUBMITRESULT :

                /* Agreement device address */
                devsel = usb_hstd_get_devsel(ptr, pipenum);

                /* Get root port number from device addr */
                rootport = usb_hstd_get_rootport(ptr, devsel);
                switch (g_usb_hstd_mgr_mode[ptr->ip][rootport])
                {
                    /* Resume */
                    case USB_RESUME_PROCESS :

                        /* Resume Sequence Number is 1 to 2 */
                        usb_hstd_resu_cont(ptr, (uint16_t) (devsel >> USB_DEVADDRBIT), (uint16_t) rootport);
                    break;

                        /* Suspend */
                    case USB_SUSPENDED_PROCESS :
                        usb_hstd_susp_cont(ptr, (uint16_t) (devsel >> USB_DEVADDRBIT), (uint16_t) rootport);
                    break;

                        /* Enumeration */
                    case USB_DEFAULT :

                        /* Peripheral Device Speed support check */
                        connect_speed = usb_hstd_support_speed_check(ptr, rootport);
                        if (USB_NOCONNECT != connect_speed)
                        {
                            enume_mode = usb_hstd_enumeration(ptr);
                            switch (enume_mode)
                            {
                                /* Detach Mode */
                                case USB_NONDEVICE :
                                    USB_PRINTF1("### Enumeration error (address%d)\n", g_usb_hstd_device_addr[ptr->ip]);
                                    g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_DETACHED;

                                    if ((USB_DO_RESET_AND_ENUMERATION == usb_shstd_mgr_msginfo[ptr->ip])
                                            || (USB_PORT_ENABLE == usb_shstd_mgr_msginfo[ptr->ip]))
                                    {
                                        usb_hstd_mgr_chgdevst_cb(ptr, rootport);
                                    }
                                break;

                                    /* Detach Mode */
                                case USB_NOTTPL :
                                    USB_PRINTF1("### Not support device (address%d)\n", g_usb_hstd_device_addr[ptr->ip]);
                                    g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_DETACHED;

                                    if ((USB_DO_RESET_AND_ENUMERATION == usb_shstd_mgr_msginfo[ptr->ip])
                                            || (USB_PORT_ENABLE == usb_shstd_mgr_msginfo[ptr->ip]))
                                    {
                                        usb_hstd_mgr_chgdevst_cb(ptr, rootport);
                                    }
                                break;
                                case USB_COMPLETEPIPESET :
                                    g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_CONFIGURED;

                                    if ((USB_DO_RESET_AND_ENUMERATION == usb_shstd_mgr_msginfo[ptr->ip])
                                            || (USB_PORT_ENABLE == usb_shstd_mgr_msginfo[ptr->ip]))
                                    {
                                        usb_hstd_mgr_chgdevst_cb(ptr, rootport);
                                    }
                                break;
                                default :
                                break;
                            }
                        }
                    break;
                    default :
                    break;
                }
                usb_hstd_mgr_rel_mpl(ptr, msginfo);
            break;
            case USB_MSG_MGR_AORDETACH :
                switch (p_usb_shstd_mgr_msg[ptr->ip]->result)
                {
                    case USB_DETACH :
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
                        disp_param.status = USB_CT_DETACH;
                        disp_param.pid    = USB_NULL;
                        disp_param.vid    = USB_NULL;
                        usb_compliance_disp ((void *)&disp_param);
#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */
                        USB_PRINTF1(" [Detach Device port%d] \n", rootport);
                        g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_DETACHED;
                        g_usb_hstd_device_speed[ptr->ip] = USB_NOCONNECT;

                        for (md = 0; md < g_usb_hstd_device_num[ptr->ip]; md++)
                        {
                            driver = &g_usb_hstd_device_drv[ptr->ip][md];
                            if ((rootport + USB_DEVICEADDR) == driver->devaddr)
                            {
                                if (USB_NULL == driver->devdetach)   /* Chack Callback function */
                                {
                                    while(1)
                                    {
                                        /* Error Stop */
                                    }
                                }

#if defined(USB_CFG_HHID_USE)
                                if (USB_DEVICEADDR == driver->devaddr)
                                {
                                    g_usb_change_device_state[ptr->ip] = USB_NULL;
                                }

