tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hmanager.c
#endif  /* defined(USB_CFG_HHID_USE) */

                                (*driver->devdetach)(ptr, driver->devaddr, (uint16_t) USB_NO_ARG);

                                /* Root port */
                                g_usb_hstd_device_info[ptr->ip][driver->devaddr][0] = USB_NOPORT;

                                /* Device state */
                                g_usb_hstd_device_info[ptr->ip][driver->devaddr][1] = USB_DETACHED;

                                /* Not configured */
                                g_usb_hstd_device_info[ptr->ip][driver->devaddr][2] = (uint16_t) 0;

                                /* Interface Class : NO class */
                                g_usb_hstd_device_info[ptr->ip][driver->devaddr][3] = (uint16_t) USB_IFCLS_NOT;

                                /* No connect */
                                g_usb_hstd_device_info[ptr->ip][driver->devaddr][4] = (uint16_t) USB_NOCONNECT;

                                /* Root port */
                                driver->rootport = USB_NOPORT;

                                /* Device address */
                                driver->devaddr = USB_NODEVICE;

                                /* Device state */
                                driver->devstate = USB_DETACHED;
                            }
                        }
                        usb_hstd_mgr_rel_mpl(ptr, msginfo);
                    break;
                    case USB_ATTACHL :

                        /* continue */
                    case USB_ATTACHF :
#if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
                        disp_param.status = USB_CT_ATTACH;
                        disp_param.pid    = USB_NULL;
                        disp_param.vid    = USB_NULL;
                        usb_compliance_disp ((void *)&disp_param);

#endif /* USB_CFG_COMPLIANCE == USB_CFG_ENABLE */

                        if (USB_DETACHED == g_usb_hstd_mgr_mode[ptr->ip][rootport])
                        {
                            /* enumeration wait setting */
                            g_usb_hstd_enu_wait[ptr->ip] = (uint8_t) USB_MGR_TSK;
                            g_usb_hstd_device_addr[ptr->ip] = (uint16_t) (rootport + USB_DEVICEADDR);
                            if (USB_MAXDEVADDR < g_usb_hstd_device_addr[ptr->ip])
                            {
                                /* For port1 */
                                USB_PRINTF0("Device address error\n");
                            }
                            else
                            {
                                g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_DEFAULT;

#if USB_CFG_BC == USB_CFG_ENABLE
                                /* Call Back */
                                /*USB_BC_ATTACH(ptr, g_usb_hstd_device_addr[ptr->ip], (uint16_t)g_usb_hstd_bc[ptr->ip].state); */
                                if (USB_BC_STATE_CDP == g_usb_hstd_bc[ptr->ip].state)
                                {
                                    ctrl.address = g_usb_hstd_device_addr[ptr->ip]; /* USB Device address */
                                    ctrl.module = ptr->ip;                          /* Module number setting */
                                    usb_set_event(USB_STS_BC, &ctrl);               /* Set Event()  */
                                }
#endif /* USB_CFG_BC == USB_CFG_ENABLE */

                                usb_hstd_attach_function();
                                usb_hstd_mgr_reset(ptr, g_usb_hstd_device_addr[ptr->ip]);
                            }
                            usb_hstd_mgr_rel_mpl(ptr, msginfo);
                        }
                        else
                        {
                            /* enumeration wait setting */
                            g_usb_hstd_enu_wait[ptr->ip] = (uint8_t) USB_MGR_TSK;
                            usb_hstd_mgr_rel_mpl(ptr, msginfo);
                        }
                    break;
                    default :
                        usb_hstd_mgr_rel_mpl(ptr, msginfo);
                    break;
                }
            break;
            case USB_MSG_MGR_OVERCURRENT :
                ctrl.module = ptr->ip;                      /* Module number setting */
                usb_set_event(USB_STS_OVERCURRENT, &ctrl);  /* Set Event()  */

                USB_PRINTF0(" Please detach device \n ");
                USB_PRINTF1("VBUS off port%d\n", rootport);
                usb_hstd_vbus_control(ptr, rootport, (uint16_t) USB_VBOFF);
                g_usb_hstd_mgr_mode[ptr->ip][rootport] = USB_DEFAULT;
                for (md = 0; md < g_usb_hstd_device_num[ptr->ip]; md++)
                {
                    driver = &g_usb_hstd_device_drv[ptr->ip][md];
                    if (driver->rootport == rootport)
                    {

                        /* Root port */
                        g_usb_hstd_device_info[ptr->ip][driver->devaddr][0] = USB_NOPORT;

                        /* Device state */
                        g_usb_hstd_device_info[ptr->ip][driver->devaddr][1] = USB_DETACHED;

                        /* Not configured */
                        g_usb_hstd_device_info[ptr->ip][driver->devaddr][2] = (uint16_t) 0;

                        /* Interface Class : NO class */
                        g_usb_hstd_device_info[ptr->ip][driver->devaddr][3] = (uint16_t) USB_IFCLS_NOT;

                        /* No connect */
                        g_usb_hstd_device_info[ptr->ip][driver->devaddr][4] = (uint16_t) USB_NOCONNECT;

                        /* Root port */
                        driver->rootport = USB_NOPORT;

                        /* Device address */
                        driver->devaddr = USB_NODEVICE;

                        /* Device state */
                        driver->devstate = USB_DETACHED;
                    }
                }
                usb_hstd_mgr_rel_mpl(ptr, msginfo);
            break;

                /* USB_MSG_HCD_ATTACH */
            case USB_DO_RESET_AND_ENUMERATION :
                ptr->msginfo = USB_MSG_HCD_ATTACH_MGR;

                if (USB_DEVICEADDR == devaddr)
                {
                    g_usb_hstd_mgr_mode[ptr->ip][USB_PORT0] = USB_DETACHED;
                }
                else
                {
                    /* Non */
                }

                usb_hstd_device_state_ctrl2(ptr, hp->complete, devaddr, ptr->msginfo, msginfo);
                usb_hstd_mgr_rel_mpl(ptr, msginfo);
            break;

