tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/driver/r_usb_hmanager.c
                /* USB_MSG_HCD_VBON */
            case USB_PORT_ENABLE :
                ptr->msginfo = USB_MSG_HCD_VBON;
                if (USB_DEVICEADDR == devaddr)
                {
                    g_usb_hstd_mgr_mode[ptr->ip][USB_PORT0] = USB_DETACHED;
                }
                else
                {
                    /* Non */
                }
                usb_hstd_device_state_ctrl2(ptr, hp->complete, devaddr, ptr->msginfo, msginfo);
                usb_hstd_mgr_rel_mpl(ptr, msginfo);
            break;

                /* USB_MSG_HCD_VBOFF */
            case USB_PORT_DISABLE :

                /* VBUS is off at the time of the abnormalities in a device */
                ptr->msginfo = USB_MSG_HCD_VBOFF;
                if (USB_DEVICEADDR == devaddr)
                {
                    g_usb_hstd_mgr_mode[ptr->ip][USB_PORT0] = USB_DETACHED;
                }
                else
                {
                    /* Non */
                }
                usb_hstd_device_state_ctrl2(ptr, hp->complete, devaddr, ptr->msginfo, msginfo);
                usb_hstd_mgr_rel_mpl(ptr, msginfo);
            break;

                /* USB_MSG_HCD_SUSPEND */
            case USB_DO_GLOBAL_SUSPEND :
                ptr->msginfo = USB_MSG_HCD_REMOTE;
                usb_shstd_mgr_callback[ptr->ip] = hp->complete;
                usb_shstd_mgr_msginfo[ptr->ip] = msginfo;
                usb_hstd_mgr_suspend(ptr, msginfo);
            break;

                /* USB_MSG_HCD_SUSPEND */
            case USB_DO_SELECTIVE_SUSPEND :
                ptr->msginfo = USB_MSG_HCD_REMOTE;
                usb_hstd_mgr_suspend(ptr, msginfo);
                usb_hstd_device_state_ctrl2(ptr, hp->complete, devaddr, ptr->msginfo, msginfo);
            break;

                /* USB_MSG_HCD_RESUME */
            case USB_DO_GLOBAL_RESUME :
                ptr->msginfo = USB_MSG_HCD_RESUME;
                usb_shstd_mgr_callback[ptr->ip] = hp->complete;
                usb_shstd_mgr_msginfo[ptr->ip] = msginfo;
                usb_hstd_mgr_resume(ptr, msginfo);
            break;

                /* USB_MSG_HCD_RESUME */
            case USB_MSG_HCD_RESUME :
                usb_shstd_mgr_msginfo[ptr->ip] = msginfo;
                usb_hstd_mgr_resume(ptr, msginfo);
            break;

                /* USB_MSG_HCD_RESUME */
            case USB_DO_SELECTIVE_RESUME :
                ptr->msginfo = USB_MSG_HCD_RESUME;
                usb_hstd_mgr_resume(ptr, msginfo);
                usb_hstd_device_state_ctrl2(ptr, hp->complete, devaddr, ptr->msginfo, msginfo);
            break;

            default :
                usb_hstd_mgr_rel_mpl(ptr, msginfo);
            break;
        }
    }
}
/******************************************************************************
 End of function usb_hstd_mgr_task
 ******************************************************************************/
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 End  Of File
 ******************************************************************************/
